package Basic.Project;

public class HomeWork05122022 {
    /*
    По домашнему заданию - реализуйте сценарий работы кофейного аппарата. Для этого
    необходимо считывать номер нажатой кнопки (от 1 до 4), где 1 - эспрессо,
    2 - американо, 3 - капучино, 4 - чай. При этом каждый напиток включает в себя
    определенные действия (элементарные процессы будут описаны ниже), которые можно
    упаковать в отдельные самостоятельные методы (для их многократного использования)
    класса CoffeeMachine.
    Выбор кнопки можно считывать через командную строку (например в int значение через сканнер), алгоритм можно реализовать через if-else или через switch.
    Эспрессо - минимально неразделимый процесс.
    Американо - эспрессо + добавление воды.
    Капучино - эспрессо + добавление вспененного молока.
    Чай - выбор чайного пакетика + добавление воды.
     */

    public static void main(String[] args) {
        new CoffeeMachine();
    }
}
